// Вывести на экран число e (основание натурального логарифма) 
// с точностью до десятых.

Console.WriteLine("2,7");

double e;
e = 2.71828;

Console.WriteLine("Основание натурального логорифма равно {0}", e );
Console.WriteLine("Вывод на экран числа e с точностью до десятых: {0:#.#}", e);
Console.ReadLine();
