// Составить программу вывода на экран в одну строку четырех любых чисел 
// с тремя пробелами между ними.

// Простой вариант
Console.WriteLine("5   6   7   8   ");
 
// и с присвоением переменных
int a = 10;
int b = 3;
int c = 8;
int d = 2;

Console.WriteLine($"{a}   {b}   {c}   {d}");
