// Вывести на экран число «ПИ» с точностью до сотых.


Console.WriteLine("3.14");


// Вывести на экран число «ПИ» с точностью до пяти знаков после запятой.
double pi;
pi = 3.1415926535;

Console.WriteLine("Пи равно:{0}", pi);
Console.WriteLine("Вывод на экран в точности пять знаков после запятой: {0:#.#####}", pi);
Console.ReadLine();
